Davidap041/Arm_Code_KL43z/Robot_ARM_MCU_KL43z_Controladores/Robot_Arm_Control_Law_PD2/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '2', peripheral: I2C1, signal: SCL, pin_signal: LCD_P49/PTE1/SPI1_MOSI/LPUART1_RX/SPI1_MISO/I2C1_SCL, identifier: Sensor_3_e_4_SCL}
  - {pin_num: '1', peripheral: I2C1, signal: SDA, pin_signal: LCD_P48/PTE0/CLKOUT32K/SPI1_MISO/LPUART1_TX/RTC_CLKOUT/CMP0_OUT/I2C1_SDA, identifier: Sensor_3_e_4_SDA}
  - {pin_num: '60', peripheral: TPM0, signal: 'CH, 3', pin_signal: LCD_P43/PTD3/SPI0_MISO/UART2_TX/TPM0_CH3/SPI0_MOSI/FXIO0_D3, identifier: PWM4, direction: OUTPUT}
  - {pin_num: '61', peripheral: TPM0, signal: 'CH, 4', pin_signal: LCD_P44/PTD4/LLWU_P14/SPI1_SS/UART2_RX/TPM0_CH4/FXIO0_D4, identifier: PWM5, direction: OUTPUT}
  - {pin_num: '62', peripheral: TPM0, signal: 'CH, 5', pin_signal: LCD_P45/ADC0_SE6b/PTD5/SPI1_SCK/UART2_TX/TPM0_CH5/FXIO0_D5, identifier: PWM6, direction: OUTPUT}
  - {pin_num: '18', peripheral: DAC0, signal: OUT, pin_signal: DAC0_OUT/ADC0_SE23/CMP0_IN4/PTE30/TPM0_CH3/TPM_CLKIN1/LPUART1_TX/LPTMR0_ALT1}
  - {pin_num: '44', peripheral: TPM0, signal: 'CH, 0', pin_signal: LCD_P21/ADC0_SE15/PTC1/LLWU_P6/RTC_CLKIN/I2C1_SCL/TPM0_CH0/I2S0_TXD0, identifier: PWM1, direction: OUTPUT}
  - {pin_num: '45', peripheral: TPM0, signal: 'CH, 1', pin_signal: LCD_P22/ADC0_SE11/PTC2/I2C1_SDA/TPM0_CH1/I2S0_TX_FS, identifier: PWM2, direction: OUTPUT}
  - {pin_num: '59', peripheral: TPM0, signal: 'CH, 2', pin_signal: LCD_P42/PTD2/SPI0_MOSI/UART2_RX/TPM0_CH2/SPI0_MISO/FXIO0_D2, identifier: PWM3, direction: OUTPUT}
  - {pin_num: '36', peripheral: I2C0, signal: SDA, pin_signal: LCD_P1/ADC0_SE9/PTB1/I2C0_SDA/TPM1_CH1, identifier: Sensor_1_e_2_SDA}
  - {pin_num: '35', peripheral: I2C0, signal: SCL, pin_signal: LCD_P0/ADC0_SE8/PTB0/LLWU_P5/I2C0_SCL/TPM1_CH0, identifier: Sensor_1_e_2_SCL}
  - {pin_num: '9', peripheral: GPIOE, signal: 'GPIO, 20', pin_signal: LCD_P59/ADC0_DP0/ADC0_SE0/PTE20/TPM1_CH0/LPUART0_TX/FXIO0_D4, identifier: Sensor_1, direction: OUTPUT,
    gpio_init_state: 'true'}
  - {pin_num: '10', peripheral: GPIOE, signal: 'GPIO, 21', pin_signal: LCD_P60/ADC0_DM0/ADC0_SE4a/PTE21/TPM1_CH1/LPUART0_RX/FXIO0_D5, identifier: Sensor_2, direction: OUTPUT,
    gpio_init_state: 'true'}
  - {pin_num: '11', peripheral: GPIOE, signal: 'GPIO, 22', pin_signal: ADC0_DP3/ADC0_SE3/PTE22/TPM2_CH0/UART2_TX/FXIO0_D6, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '12', peripheral: GPIOE, signal: 'GPIO, 23', pin_signal: ADC0_DM3/ADC0_SE7a/PTE23/TPM2_CH1/UART2_RX/FXIO0_D7, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '23', peripheral: GPIOA, signal: 'GPIO, 1', pin_signal: PTA1/LPUART0_RX/TPM2_CH0, identifier: INTERRUPTION, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    gpio_pin_config_t INTERRUPTION_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA1 (pin 23)  */
    GPIO_PinInit(BOARD_INTERRUPTION_GPIO, BOARD_INTERRUPTION_PIN, &INTERRUPTION_config);

    gpio_pin_config_t Sensor_1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTE20 (pin 9)  */
    GPIO_PinInit(BOARD_Sensor_1_GPIO, BOARD_Sensor_1_PIN, &Sensor_1_config);

    gpio_pin_config_t Sensor_2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTE21 (pin 10)  */
    GPIO_PinInit(BOARD_Sensor_2_GPIO, BOARD_Sensor_2_PIN, &Sensor_2_config);

    gpio_pin_config_t Sensor_3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTE22 (pin 11)  */
    GPIO_PinInit(BOARD_Sensor_3_GPIO, BOARD_Sensor_3_PIN, &Sensor_3_config);

    gpio_pin_config_t Sensor_4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTE23 (pin 12)  */
    GPIO_PinInit(BOARD_Sensor_4_GPIO, BOARD_Sensor_4_PIN, &Sensor_4_config);

    /* PORTA1 (pin 23) is configured as PTA1 */
    PORT_SetPinMux(BOARD_INTERRUPTION_PORT, BOARD_INTERRUPTION_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 35) is configured as I2C0_SCL */
    PORT_SetPinMux(BOARD_Sensor_1_e_2_SCL_PORT, BOARD_Sensor_1_e_2_SCL_PIN, kPORT_MuxAlt2);

    /* PORTB1 (pin 36) is configured as I2C0_SDA */
    PORT_SetPinMux(BOARD_Sensor_1_e_2_SDA_PORT, BOARD_Sensor_1_e_2_SDA_PIN, kPORT_MuxAlt2);

    /* PORTC1 (pin 44) is configured as TPM0_CH0 */
    PORT_SetPinMux(BOARD_PWM1_PORT, BOARD_PWM1_PIN, kPORT_MuxAlt4);

